set names utf8;
drop database if exists mt;
create database mt charset=utf8;
use mt;
/*创建美团类型*/
create table mt_family(
  fid int primary key auto_increment,
  fname varchar(64)
);
/*美食*/
create table mt_goods(
  mid int primary key auto_increment,
  family_id int,
  title varchar(128),
  subtitle varchar(128),
  price1 decimal(8,2),
  price2 decimal(8,2),
  sold int,
  assess int,
  pic varchar(128),
  href varchar(128)
);
/****************************导入数据***********************/
insert into mt_family values
(null,"美食"),
(null,"休闲娱乐"),
(null,"酒店"),
(null,"生活服务"),
(null,"丽人"),
(null,"旅游");
insert into mt_goods values
(null,1,"【旺角城/银隆百货】滏山汇烤肉自助餐厅","仅售59.9元！价值69元的滏山汇烤肉自助（周一至周五午餐劵）1张，可免费使用包间，提供免费WiFi。",59.9,69,63109,6263,"img/floor.f1.1.jpg","#"),
(null,1,"【万塘路】春暖花开","仅售58元！价值59元的自助午餐",58,59,132329,20031,"img/floor.f1.2.jpg","#"),
(null,1,"【2店通用】嗨漾自助美食","仅售60元！价值69元的午餐自助。",60,69,109606,12477,"img/floor.f1.3.jpg","#"),
(null,1,"【6店通用】锅内锅外","仅售76元！价值79元的自助午餐，提供免费WiFi。",59.9,69,111552,6293,"img/floor.f1.4.jpg","#"),
(null,1,"【4店通用】真功夫","仅售7元！价值10元的馋香蒸饺 +卤蛋1份，提供免费WiFi。",7,10,3864,341,"img/floor.f1.5.jpg","#"),
(null,1,"【下沙】翰坂自助餐","仅售49元！价值59元的烤肉火锅自助午餐，提供免费WiFi。",49,59,43803,6606,"img/floor.f1.6.jpg","#"),
(null,1,"【14店通用】菲滋意式休闲餐厅","仅售27元！价值36元的果然多鲜果茶2份，提供免费WiFi。",27,36,5667,306,"img/floor.f1.7.jpg","#"),
(null,1,"【钱江新城】芭菲盛宴","仅售132元！价值158元的单人自助午餐。",132,158,27470,1429,"img/floor.f1.8.jpg","#"),
(null,2,"【通惠路沿线】胤隆会","仅售58元，价值69元单人胤隆会商务营养美食中餐，节假日通用，免费WiFi！免费停车位！",58,68,78,7,"img/floor.f2.1.jpg","#"),
(null,2,"【西城广场】唛歌KTV（西城广场店）","仅售39元，价值560元白天档/黄金档欢唱时段2选1，节假日通用，可连续欢唱！免费WiFi！",39,560,9980,588,"img/floor.f2.2.jpg","#"),
(null,2,"【近江/之江路】汗城汤泉","仅售39元，价值128元单人游泳＋浴资，节假日通用，免费WiFi！",39,128,4044,154,"img/floor.f2.3.jpg","#"),
(null,2,"【3店通用】芬芳四季养生会所","仅售48元，价值68元单人小项目5选1，节假日通用，免费WiFi，免费停车位！男女通用！",48,58,152,54,"img/floor.f2.4.jpg","#"),
(null,2,"【文一路沿线】银乐迪INLOVE KTV（文一店）","仅售69元，价值110元白天档/黄金档/凌晨档欢唱套餐，可连续欢唱，免开机费！免费WiFi！",69,118,5910,1154,"img/floor.f2.5.jpg","#"),
(null,2,"【城厢】尚鼎水府","仅售69元，价值89元单人浴资，节假日通用，免费WiFi，免费停车位，男女通用！",69,89,25910,11854,"img/floor.f2.6.jpg","#"),
(null,2,"【瓜沥镇】鸿轩足浴","仅售79元，价值90元单人鸿轩浴盐足浴套餐，节假日通用！",79,89,1051,550,"img/floor.f2.7.jpg","#"),
(null,2,"【龙翔桥/市一医院】长藤鬼校","仅售77元，价值78元長藤鬼校惊悚体验单人券，节假日通用！",77,78,2972,220,"img/floor.f2.8.jpg","#"),
(null,3,"千岛湖丽景酒店","[阳光路]淳安县千岛湖镇阳光路阳光水岸度假村内",198,369,6987,2000,"img/floor.f3.1.jpg","#"),
(null,3,"【杭州等】金马饭店(通惠中路店)+云栖竹径+双早","仅售545元！价值1088元金马饭店(通惠中路店)+云栖竹径+双早",545,1088,6,0,"img/floor.f3.2.jpg","#"),
(null,3,"【西溪】杭州栖泊酒店","仅售98元！价值159元的杭州栖泊酒店温馨大床房钟点房4小时，免费WiFi。欢迎入住",98,108,60,18,"img/floor.f3.3.jpg","#"),
(null,3,"【运河广场】曼辰精品酒店","仅售80元！价值88元的曼辰精品酒店温馨大床房钟点房4小时，免费WiFi。价格实惠，值得推荐",159,28,160,18,"img/floor.f3.4.jpg","#"),
(null,3,"浙江国际大酒店","下城区体育场路221号，与中河路交叉口",610,1228,2160,418,"img/floor.f3.5.jpg","#"),
(null,3,"爆米花影院酒店(杭州高沙商业街店)","江干区学林街新元金沙城1261-5号",108,228,2260,3418,"img/floor.f3.6.jpg","#"),
(null,3,"珺逸主题酒店","江干区丁桥镇蕙兰雅路366号6",208,528,1260,218,"img/floor.f3.7.jpg","#"),
(null,3,"天逅酒店(学源街店)","江干区学源街1185号高沙学源大厦1楼1199号（高沙商业街）",168,328,5260,1218,"img/floor.f3.8.jpg","#"),
(null,4,"【14店通用】宝岛眼镜","仅售50元，价值120元豪华1+7验光服务，节假日通用！",50,120,5293,1218,"img/floor.f4.1.jpg","#"),
(null,4,"【17店通用】花冠鲜花","仅售9.9元，价值15元单枝玫瑰花 自提配送均可 20支起送，节假日通用！",9.9,15,1768,118,"img/floor.f4.2.jpg","#"),
(null,4,"【9店通用】先花店","仅售87元，价值174元11枝红/粉玫 19枝红/粉康 鲜花预订 超值精品爆款礼盒！节假日通用！",87,175,768,58,"img/floor.f4.3.jpg","#"),
(null,4,"【22店通用】美尚美鲜花","仅售82元，价值189元9枝昆明A级玫瑰花束，节假日通用！鲜花1束，免费赠送卡片一张！",82,175,558,106,"img/floor.f4.4.jpg","#");
